dev-board-tech/ArduinoHK32F030M/hardware/hk32f030m/0.1.0/boards.txt
# See: https://arduino.github.io/arduino-cli/latest/platform-specification/

menu.pnum=Board part number

menu.extclk=EXT CLK Freq
menu.xserial=UART support
menu.xi2c=I2C support
menu.xspi=SPI support
menu.rtos=RTOS support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)

menu.opt=Optimize
menu.dbg=Debug symbols and core logs
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

###############################
# HK32F030MJ4M6
J4M6.name=HK32F030MJ4M6

J4M6.build.core=arduino
J4M6.build.board=J4M6
J4M6.build.mcu=cortex-m0
J4M6.build.series=HK32F030M
J4M6.build.st_extra_flags=-D{build.product_line} {build.xSerial} {build.xI2C} {build.xSPI} {build.RTOS} -DEXTCLK_VALUE={build.extclk}
J4M6.build.flash_offset=0x0
J4M6.upload.maximum_size=0
J4M6.upload.maximum_data_size=0
J4M6.openocd.target=stm32f0x
J4M6.vid.0=0x0483
J4M6.pid.0=0x5740

# DEMO_F030M_8M board
J4M6.menu.pnum.HK32F030MJ4M6=HK32F030MJ4M6 (HSI 8Mhz)
J4M6.menu.pnum.HK32F030MJ4M6.upload.maximum_size=16384
J4M6.menu.pnum.HK32F030MJ4M6.upload.maximum_data_size=2048
J4M6.menu.pnum.HK32F030MJ4M6.build.board=HK32F030MJ4M6
J4M6.menu.pnum.HK32F030MJ4M6.build.clksrc=SYSCLK_SRC_HSI8M
J4M6.menu.pnum.HK32F030MJ4M6.build.product_line=hk32f030mf4p6
J4M6.menu.pnum.HK32F030MJ4M6.build.variant=HK32F030M/J4M6
J4M6.menu.pnum.HK32F030MJ4M6.build.variant_h=variant_HK32F030MJ4M6.h
J4M6.menu.pnum.HK32F030MJ4M6.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_16M board
J4M6.menu.pnum.HK32F030MJ4M6_16M=HK32F030MJ4M6 (HSI 16Mhz)
J4M6.menu.pnum.HK32F030MJ4M6_16M.upload.maximum_size=16384
J4M6.menu.pnum.HK32F030MJ4M6_16M.upload.maximum_data_size=2048
J4M6.menu.pnum.HK32F030MJ4M6_16M.build.board=HK32F030MJ4M6
J4M6.menu.pnum.HK32F030MJ4M6_16M.build.clksrc=SYSCLK_SRC_HSI16M
J4M6.menu.pnum.HK32F030MJ4M6_16M.build.product_line=hk32f030mf4p6
J4M6.menu.pnum.HK32F030MJ4M6_16M.build.variant=HK32F030M/J4M6
J4M6.menu.pnum.HK32F030MJ4M6_16M.build.variant_h=variant_HK32F030MJ4M6.h
J4M6.menu.pnum.HK32F030MJ4M6_16M.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_32M board
J4M6.menu.pnum.HK32F030MJ4M6_32M=HK32F030MJ4M6 (HSI 32Mhz)
J4M6.menu.pnum.HK32F030MJ4M6_32M.upload.maximum_size=16384
J4M6.menu.pnum.HK32F030MJ4M6_32M.upload.maximum_data_size=2048
J4M6.menu.pnum.HK32F030MJ4M6_32M.build.board=HK32F030MJ4M6
J4M6.menu.pnum.HK32F030MJ4M6_32M.build.clksrc=SYSCLK_SRC_HSI32M
J4M6.menu.pnum.HK32F030MJ4M6_32M.build.product_line=hk32f030mf4p6
J4M6.menu.pnum.HK32F030MJ4M6_32M.build.variant=HK32F030M/J4M6
J4M6.menu.pnum.HK32F030MJ4M6_32M.build.variant_h=variant_HK32F030MJ4M6.h
J4M6.menu.pnum.HK32F030MJ4M6_32M.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_LSI board
J4M6.menu.pnum.HK32F030MJ4M6_LSI=HK32F030MJ4M6 (LSI internal RC oscillator)
J4M6.menu.pnum.HK32F030MJ4M6_LSI.upload.maximum_size=16384
J4M6.menu.pnum.HK32F030MJ4M6_LSI.upload.maximum_data_size=2048
J4M6.menu.pnum.HK32F030MJ4M6_LSI.build.board=HK32F030MJ4M6
J4M6.menu.pnum.HK32F030MJ4M6_LSI.build.clksrc=SYSCLK_SRC_LSI
J4M6.menu.pnum.HK32F030MJ4M6_LSI.build.product_line=hk32f030mf4p6
J4M6.menu.pnum.HK32F030MJ4M6_LSI.build.variant=HK32F030M/J4M6
J4M6.menu.pnum.HK32F030MJ4M6_LSI.build.variant_h=variant_HK32F030MJ4M6.h
J4M6.menu.pnum.HK32F030MJ4M6_LSI.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

# DEMO_F030M_EXTKLK board
J4M6.menu.pnum.HK32F030MJ4M6_EXT=HK32F030MJ4M6 (External clock)
J4M6.menu.pnum.HK32F030MJ4M6_EXT.upload.maximum_size=16384
J4M6.menu.pnum.HK32F030MJ4M6_EXT.upload.maximum_data_size=2048
J4M6.menu.pnum.HK32F030MJ4M6_EXT.build.board=HK32F030MJ4M6
J4M6.menu.pnum.HK32F030MJ4M6_EXT.build.clksrc=SYSCLK_SCR_EXTCLK_IO
J4M6.menu.pnum.HK32F030MJ4M6_EXT.build.product_line=hk32f030mf4p6
J4M6.menu.pnum.HK32F030MJ4M6_EXT.build.variant=HK32F030M/J4M6
J4M6.menu.pnum.HK32F030MJ4M6_EXT.build.variant_h=variant_HK32F030MJ4M6.h
J4M6.menu.pnum.HK32F030MJ4M6_EXT.debug.svd_file={runtime.tools.HK32F030M_SVD.path}/svd/HK32F030M.svd

J4M6.menu.extclk.32mhz=32000Khz
J4M6.menu.extclk.24mhz=24000Khz
J4M6.menu.extclk.24mhz.build.extclk=24000000
J4M6.menu.extclk.20mhz=20000Khz
J4M6.menu.extclk.20mhz.build.extclk=20000000
J4M6.menu.extclk.16mhz=16000Khz
J4M6.menu.extclk.16mhz.build.extclk=16000000
J4M6.menu.extclk.12mhz=120000Khz
J4M6.menu.extclk.12mhz.build.extclk=12000000
J4M6.menu.extclk.10mhz=10000Khz
J4M6.menu.extclk.10mhz.build.extclk=10000000
J4M6.menu.extclk.8mhz=8000Khz
J4M6.menu.extclk.8mhz.build.extclk=8000000
J4M6.menu.extclk.73728khz=73728Khz
J4M6.menu.extclk.73728khz.build.extclk=73728000
J4M6.menu.extclk.6mhz=6000Khz
J4M6.menu.extclk.6mhz.build.extclk=6000000
J4M6.menu.extclk.4mhz=4000Khz
J4M6.menu.extclk.4mhz.build.extclk=4000000
J4M6.menu.extclk.36864khz=36864Khz
J4M6.menu.extclk.36864khz.build.extclk=36864000
J4M6.menu.extclk.2mhz=2000Khz
J4M6.menu.extclk.2mhz.build.extclk=2000000
J4M6.menu.extclk.1mhz=4000Khz
J4M6.menu.extclk.1mhz.build.extclk=1000000

# Upload menu
J4M6.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
J4M6.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
J4M6.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

J4M6.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
J4M6.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
J4M6.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload
J4M6.menu.upload_method.OpenOCDDapLink.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
J4M6.menu.upload_method.OpenOCDDapLink.debug.server.openocd.scripts.1={runtime.platform.path}/debugger/select_swd.cfg

J4M6.menu.xserial.disabled=Disabled (no Serial support)
J4M6.menu.xserial.disabled.build.xSerial=
J4M6.menu.xserial.enabled=Enabled (generic 'Serial')
J4M6.menu.xserial.enabled.build.xSerial=-DHAL_UART_MODULE_ENABLED
J4M6.menu.xserial.none=Enabled (no generic 'Serial')
J4M6.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE

J4M6.menu.xi2c.disabled=Disabled (no I2C support)
J4M6.menu.xi2c.disabled.build.xI2C=
J4M6.menu.xi2c.enabled=Enabled (generic 'I2C')
J4M6.menu.xi2c.enabled.build.xI2C=-DHAL_I2C_MODULE_ENABLED

