dev-board-tech/ArduinoHK32F030M/hardware/hk32f030m/0.1.0/boards.txt
F4N6.menu.extclk.32mhz=32000Khz
F4N6.menu.extclk.24mhz=24000Khz
F4N6.menu.extclk.24mhz.build.extclk=24000000
F4N6.menu.extclk.20mhz=20000Khz
F4N6.menu.extclk.20mhz.build.extclk=20000000
F4N6.menu.extclk.16mhz=16000Khz
F4N6.menu.extclk.16mhz.build.extclk=16000000
F4N6.menu.extclk.12mhz=120000Khz
F4N6.menu.extclk.12mhz.build.extclk=12000000
F4N6.menu.extclk.10mhz=10000Khz
F4N6.menu.extclk.10mhz.build.extclk=10000000
F4N6.menu.extclk.8mhz=8000Khz
F4N6.menu.extclk.8mhz.build.extclk=8000000
F4N6.menu.extclk.73728khz=73728Khz
F4N6.menu.extclk.73728khz.build.extclk=73728000
F4N6.menu.extclk.6mhz=6000Khz
F4N6.menu.extclk.6mhz.build.extclk=6000000
F4N6.menu.extclk.4mhz=4000Khz
F4N6.menu.extclk.4mhz.build.extclk=4000000
F4N6.menu.extclk.36864khz=36864Khz
F4N6.menu.extclk.36864khz.build.extclk=36864000
F4N6.menu.extclk.2mhz=2000Khz
F4N6.menu.extclk.2mhz.build.extclk=2000000
F4N6.menu.extclk.1mhz=4000Khz
F4N6.menu.extclk.1mhz.build.extclk=1000000

# Upload menu
F4N6.menu.upload_method.OpenOCDSTLink=OpenOCD STLink (SWD)
F4N6.menu.upload_method.OpenOCDSTLink.upload.protocol=stlink
F4N6.menu.upload_method.OpenOCDSTLink.upload.tool=openocd_upload

F4N6.menu.upload_method.OpenOCDDapLink=OpenOCD DapLink (SWD)
F4N6.menu.upload_method.OpenOCDDapLink.upload.protocol=cmsis-dap
F4N6.menu.upload_method.OpenOCDDapLink.upload.tool=openocd_upload
F4N6.menu.upload_method.OpenOCDDapLink.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
F4N6.menu.upload_method.OpenOCDDapLink.debug.server.openocd.scripts.1={runtime.platform.path}/debugger/select_swd.cfg

F4N6.menu.xserial.disabled=Disabled (no Serial support)
F4N6.menu.xserial.disabled.build.xSerial=
F4N6.menu.xserial.enabled=Enabled (generic 'Serial')
F4N6.menu.xserial.enabled.build.xSerial=-DHAL_UART_MODULE_ENABLED
F4N6.menu.xserial.none=Enabled (no generic 'Serial')
F4N6.menu.xserial.none.build.xSerial=-DHAL_UART_MODULE_ENABLED -DHWSERIAL_NONE

F4N6.menu.xi2c.disabled=Disabled (no I2C support)
F4N6.menu.xi2c.disabled.build.xI2C=
F4N6.menu.xi2c.enabled=Enabled (generic 'I2C')
F4N6.menu.xi2c.enabled.build.xI2C=-DHAL_I2C_MODULE_ENABLED

F4N6.menu.xspi.disabled=Disabled (no SPI support)
F4N6.menu.xspi.disabled.build.xSPI=
F4N6.menu.xspi.enabled=Enabled (generic 'SPI')
F4N6.menu.xspi.enabled.build.xSPI=-DHAL_SPI_MODULE_ENABLED

F4N6.menu.rtos.disabled=Disabled
F4N6.menu.rtos.disabled.build.RTOS=
F4N6.menu.rtos.enabled=Enabled
F4N6.menu.rtos.enabled.build.RTOS=-DRTOS_ENABLED

F4N6.menu.opt.osstd=Smallest (-Os default)
F4N6.menu.opt.oslto=Smallest (-Os) with LTO
F4N6.menu.opt.oslto.build.flags.optimize=-Os -flto
F4N6.menu.opt.o1std=Fast (-O1)
F4N6.menu.opt.o1std.build.flags.optimize=-O1
F4N6.menu.opt.o1lto=Fast (-O1) with LTO
F4N6.menu.opt.o1lto.build.flags.optimize=-O1 -flto
F4N6.menu.opt.o2std=Faster (-O2)
F4N6.menu.opt.o2std.build.flags.optimize=-O2
F4N6.menu.opt.o2lto=Faster (-O2) with LTO
F4N6.menu.opt.o2lto.build.flags.optimize=-O2 -flto
F4N6.menu.opt.o3std=Fastest (-O3)
F4N6.menu.opt.o3std.build.flags.optimize=-O3
F4N6.menu.opt.o3lto=Fastest (-O3) with LTO
F4N6.menu.opt.o3lto.build.flags.optimize=-O3 -flto
F4N6.menu.opt.ogstd=Debug (-Og)
F4N6.menu.opt.ogstd.build.flags.optimize=-Og
F4N6.menu.opt.o0std=No Optimization (-O0)
F4N6.menu.opt.o0std.build.flags.optimize=-O0

F4N6.menu.dbg.none=None
F4N6.menu.dbg.enable_sym=Symbols Enabled (-g)
F4N6.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
F4N6.menu.dbg.enable_log=Core logs Enabled
F4N6.menu.dbg.enable_log.build.flags.debug=
F4N6.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
F4N6.menu.dbg.enable_all.build.flags.debug=-g

F4N6.menu.rtlib.nano=Newlib Nano (default)
F4N6.menu.rtlib.nanofp=Newlib Nano + Float Printf
F4N6.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
F4N6.menu.rtlib.nanofs=Newlib Nano + Float Scanf
F4N6.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
F4N6.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
F4N6.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
F4N6.menu.rtlib.full=Newlib Standard
F4N6.menu.rtlib.full.build.flags.ldspecs=


